tsung/critical.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug" dumptraffic="true">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='20000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="swiper-dev.djdchrczj9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="0.25" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="0.5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="0.75" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="1.5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="2.5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="3" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="5" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="11" duration="30" unit="second">
      <users arrivalrate="6" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="12" duration="30" unit="second">
      <users arrivalrate="7" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="13" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="14" duration="30" unit="second">
      <users arrivalrate="9" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="15" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="16" duration="30" unit="second">
      <users arrivalrate="11" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="17" duration="30" unit="second">
      <users arrivalrate="13" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="18" duration="30" unit="second">
      <users arrivalrate="15" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="19" duration="30" unit="second">
      <users arrivalrate="17" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="20" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="21" duration="30" unit="second">
      <users arrivalrate="23" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="22" duration="30" unit="second">
      <users arrivalrate="26" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="23" duration="30" unit="second">
      <users arrivalrate="29" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="24" duration="30" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="25" duration="30" unit="second">
      <users arrivalrate="36" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="26" duration="30" unit="second">
      <users arrivalrate="40" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="27" duration="30" unit="second">
      <users arrivalrate="44" unit="second"></users>
    </arrivalphase>

    <arrivalphase phase="28" duration="30" unit="second">
      <users arrivalrate="48" unit="second"></users>
    </arrivalphase>

    
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="http-example" probability="100" type="ts_http">
      <!-- REQUEST GET visit the base page -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- REQUEST GET go to login page -->
      <request>
        <http url='/sign_in' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 1 second -->
      <thinktime value="1" random="true"></thinktime>

      <!-- REQUEST GET go to to sign_up page and pull authenticity_token-->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/sign_up' version='1.1' method='GET'>
          <http_header name="Cookie" value="%%_cookie%%" />
        </http>
      </request>
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_authenticity_token" />
			</setdynvars>

      <!-- wait for up to 2 seconds, user is filling out new user form -->
      <thinktime value="2" random="true" ></thinktime>

      <!-- REQUEST POST make a user -->
      <request subst="true">
        <http url='/users' version='1.1'
        contents='authenticity_token=%%_encoded_authenticity_token%%&amp;user%5Bemail%5D=tsung%%_tsung_userid%%%40example.com&amp;user%5Bpassword%5D=test&amp;commit=Sign+Up'
        content_type='application/x-www-form-urlencoded' method='POST'>
        </http>
      </request>

      <!-- REQUEST GET visit root to acquire remember token -->
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>


      <!-- REQUEST GET go to new listing -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/listings/new' version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_authenticity_token" />
			</setdynvars>

      <!-- amount 1..5 -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        &quot;listing%5Bamount%5D=&quot; ++ integer_to_list(rand:uniform(5))
        end.">
				<var name="amount_query" />
			</setdynvars>

      <!-- price 3.00 .. 5.25 -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Price = 2.75 + 0.25 * rand:uniform(10), 
        &quot;listing%5Bprice%5D=&quot; ++ float_to_list(Price,[{decimals, 2}]) end.">
				<var name="price_query" />
			</setdynvars>

      <!-- random location -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Choice = rand:uniform(8), 
        if 
          Choice == 1 -> 
            &quot;listing%5Blocation%5D=BPlate&quot;;
          Choice == 2 -> 
            &quot;listing%5Blocation%5D=Covel&quot;;
          Choice == 3 -> 
            &quot;listing%5Blocation%5D=DeNeve&quot;;
          Choice == 4 -> 
            &quot;listing%5Blocation%5D=Feast&quot;;
          Choice == 5 -> 
            &quot;listing%5Blocation%5D=BCafe&quot;;
          Choice == 6 -> 
            &quot;listing%5Blocation%5D=Cafe1919&quot;;
          Choice == 7 -> 
            &quot;listing%5Blocation%5D=Rende&quot;;
          true -> 
            &quot;listing%5Blocation%5D=Study&quot;
        end end.">
        <var name="location_query" />
			</setdynvars>

      <!-- wait for up to 2 seconds, user is filling out new listing form -->
      <thinktime value="2" random="true" ></thinktime>


      <!-- REQUEST POST create listing -->
      <request subst="true">
        <dyn_variable name="redirect" re="(listings/.*)\r"/>
        <http url="/listings" version='1.1' method='POST'
        contents='authenticity_token=%%_encoded_authenticity_token%%&amp;listing%5Bstart_time%281i%29%5D=1&amp;listing%5Bstart_time%282i%29%5D=1&amp;listing%5Bstart_time%283i%29%5D=1&amp;listing%5Bstart_time%284i%29%5D=&amp;listing%5Bstart_time%285i%29%5D=&amp;listing%5Bend_time%281i%29%5D=1&amp;listing%5Bend_time%282i%29%5D=1&amp;listing%5Bend_time%283i%29%5D=1&amp;listing%5Bend_time%284i%29%5D=&amp;listing%5Bend_time%285i%29%5D=&amp;%%_amount_query%%&amp;%%_price_query%%&amp;%%_location_query%%&amp;listing%5Bdescription%5D=foobar&amp;commit=Create+Listing'
        content_type='application/x-www-form-urlencoded'></http>
      </request>

      <!-- REQUEST GET follow redirect -->
      <request subst="true">
        <dyn_variable name="csrf_token" xpath="html/head/meta[@name='csrf-token']/@content"></dyn_variable>
        <http url='/%%_redirect%%' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,[Val]}=ts_dynvars:lookup(csrf_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_csrf_token" />
			</setdynvars>

      <!-- REQUEST GET filter by everything-->
      <!-- wait for up to 2 seconds, user is filling out new filter form -->
      <thinktime value="2" random="true" ></thinktime>
      <!-- filter out only dining halls or alacarte-->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Choice = rand:uniform(2), 
        if 
          Choice == 1 -> 
            &quot;filter%5BBPlate%5D=1&amp;filter%5BCovel%5D=1&amp;filter%5BDeNeve%5D=1&amp;filter%5BFeast%5D=1&quot;;
          true -> 
            &quot;filter%5BBCafe%5D=1&amp;filter%5BCafe1919%5D=1&amp;filter%5BRende%5D=1&amp;filter%5BStudy%5D=1&quot;
        end end.">
				<var name="location_query" />
			</setdynvars>

      <!-- random amount 3..5.25 -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Price = 2.75 + 0.25 * rand:uniform(10), 
        &quot;filter%5Bprice%5D=&quot; ++ float_to_list(Price,[{decimals, 2}]) end.">
				<var name="price_query" />
			</setdynvars>

      <!-- random amount 1..5 -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        &quot;filter%5Bamount%5D=&quot; ++ integer_to_list(rand:uniform(5))
        end.">
				<var name="amount_query" />
			</setdynvars>

      <!-- random time -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        EarlyHour = rand:uniform(24) rem 24,
        LateHour = (EarlyHour + 4) rem 24,
        &quot;filter%5Bearliest%284i%29%5D=&quot; ++ integer_to_list(EarlyHour)++ &quot;&amp;filter%5Bearliest%285i%29%5D=00&amp;filter%5Blatest%284i%29%5D=&quot; ++ integer_to_list(LateHour) ++ &quot;&amp;filter%5Blatest%285i%29%5D=00&quot;
        end.">
				<var name="time_query" />
			</setdynvars>

      <!-- random payment type -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Cash = &quot;filter%5Bcash%5D=&quot; ++ integer_to_list(rand:uniform(2) - 1) ++ &quot;&amp;&quot;,
        CashApp = &quot;filter%5Bcashapp%5D=&quot; ++ integer_to_list(rand:uniform(2) - 1) ++ &quot;&amp;&quot;,
        Venmo = &quot;filter%5Bvenmoc%5D=&quot; ++ integer_to_list(rand:uniform(2) - 1) ++ &quot;&amp;&quot;,
        Paypal =&quot;filter%5Bpaypal%5D=&quot; ++ integer_to_list(rand:uniform(2) - 1),
        Cash ++ CashApp ++ Venmo ++ Paypal
        end.">
				<var name="payment_query" />
			</setdynvars>

      <request subst="true">
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%'></http>
      </request>
    
      
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Choice = rand:uniform(4), 
        if 
          Choice == 1 -> 
            &quot;sort=start_time+ASC&quot;;
          Choice == 2 -> 
            &quot;sort=start_time+DESC&quot;;
          Choice == 3 -> 
            &quot;sort=end_time+ASC&quot;;
          true ->
            &quot;sort=end_time+DESC&quot;
        end end.">
				<var name="sort_query" />
			</setdynvars>

      <!-- REQUEST GET choose random sort-->
      <request subst="true">
        <dyn_variable name="listing_id" re='id="listing-([0-9]*)"' />
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%&amp;%%_sort_query%%'></http>
      </request>

      <!-- REQUEST GET Visit the top listing -->
      <request subst='true'>
        <http url='/listings/%%_listing_id%%' />
      </request>

      <!-- flip back and forth -->
      <request subst="true">
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%&amp;%%_sort_query%%'></http>
      </request>

      <request subst='true'>
        <http url='/listings/%%_tsung_userid%%' />
      </request>

      <request subst="true">
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%&amp;%%_sort_query%%'></http>
      </request>

      <request subst='true'>
        <http url='/listings/%%_listing_id%%' />
      </request>

      <request subst="true">
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%&amp;%%_sort_query%%'></http>
      </request>

      <request subst="true">
        <http url='/listings?%%_location_query%%&amp;%%_price_query%%&amp;%%_amount_query%%&amp;%%_time_query%%&amp;%%_payment_query%%&amp;%%_sort_query%%'></http>
      </request>

      <request subst='true'>
        <http url='/listings/%%_tsung_userid%%' />
      </request>


      <!-- GET Visit a listing to reserve-->
      <request subst='true'>
        <dyn_variable name="csrf_token" xpath="html/head/meta[@name='csrf-token']/@content"></dyn_variable>
        <!-- <dyn_variable name='hour' re=''></dyn_variable>
        <dyn_variable name='minute' re=''></dyn_variable> -->
        <http url='/listings/%%_tsung_userid%%' />
      </request>
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,[Val]}=ts_dynvars:lookup(csrf_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_csrf_token" />
			</setdynvars>

       <!-- REQUEST POST reserve a listing -->
       <request subst='true'>
        <http url="/listings/%%_tsung_userid%%/reserve" version='1.1' method='POST'
        contents='authenticity_token=%%_encoded_csrf_token%%&amp;listing%5Bamount%281i%29%5D=1&amp;listing%5Breserved_time%284i%29%5D=12&amp;listing%5Breserved_time%285i%29%5D=0'
        content_type='application/x-www-form-urlencoded'></http>
       </request>

      <!-- REQUEST GET follow redirect -->
      <request subst='true'>
        <dyn_variable name="profile_id" re='profile/([0-9]*)' />
        <http url="/listings/%%_tsung_userid%%" version='1.1' method='GET'></http>
     </request>

      <!-- REQUEST GET go to your profile -->
      <request subst='true'>
        <http url="/profile/%%_profile_id%%" version='1.1' method='GET'></http>
     </request>

      <!-- REQUEST GET go to the og transaction -->
      <request subst='true'>
        <dyn_variable name="csrf_token" xpath="html/head/meta[@name='csrf-token']/@content"></dyn_variable>
        <http url="/listings/%%_tsung_userid%%" version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,[Val]}=ts_dynvars:lookup(csrf_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_csrf_token" />
			</setdynvars>

      <!-- REQUEST POST complete the transcation -->
      <request subst='true'>
        <http url="/listings/%%_tsung_userid%%/complete" version='1.1' method='POST'
        contents='authenticity_token=%%_encoded_csrf_token%%'
        content_type='application/x-www-form-urlencoded'></http>
      </request>


      <!-- follow the redirect -->
      <request subst='true'>
          <dyn_variable name="csrf_token" xpath="html/head/meta[@name='csrf-token']/@content"></dyn_variable>
          <http url="/listings/%%_tsung_userid%%" version='1.1' method='GET'></http>
      </request>
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
				{ok,[Val]}=ts_dynvars:lookup(csrf_token,DynVars),
				http_uri:encode(Val) end.">
				<var name="encoded_csrf_token" />
			</setdynvars>


      <!-- random rating 1..5 -->
      <setdynvars sourcetype="eval"
				code="fun({Pid,DynVars})->
        Rating = rand:uniform(10), 
        &quot;rating=&quot; ++ integer(Rating) end.">
				<var name="rating_query" />
			</setdynvars>


      <!-- REQUEST POST signout -->
      <request subst="true">
        <http url="/sign_out" version='1.1' method='DELETE'
        contents='authenticity_token=%%_encoded_csrf_token%%&amp;%%_rating_query%%&amp;commit=Complete'
        content_type='application/x-www-form-urlencoded'></http>
      </request>

      <!-- Uncomment the following to debug print your dynamic variables  -->
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
        io:format([126, $p, 126, $n, 126, $n], [DynVars]),
        ok end.">
        <var name="dump" />
      </setdynvars>


      
    </session>
  </sessions>
</tsung>